'''
14.11.2022 Суворов Д.С 21ИС-21
Задание 1. Дано целое число. Если оно является положительным, то вычесть из него 8; 
в противном случае не изменять его. Вывести полученное число
'''
x = int(input())
if (x > 0): 
    print (x - 8)
else: 
    print (x)
